### Libraries

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

data_set = pd.read_csv('feature scaling.csv')
data_set

  Country   Age  Salary Purchased
0       bd   44    6000       yes
1    india   55    7000        no
2       pk   66    8000        no
3       uk   77    9000       yes

In [3]:
x = data_set.iloc[:, 1:3]
x

   Age  Salary
0   44    6000
1   55    7000
2   66    8000
3   77    9000

### MIN MAX SCALER (Normalization)

In [4]:
from sklearn.preprocessing import MinMaxScaler

MMS = MinMaxScaler()

x_after_min_max_scaler = MMS.fit_transform(x)

x_after_min_max_scaler

array([[0.        , 0.        ],
       [0.33333333, 0.33333333],
       [0.66666667, 0.66666667],
       [1.        , 1.        ]])

In [5]:
df = pd.DataFrame(data = x_after_min_max_scaler,columns =['Age','Salary'])
df

        Age    Salary
0  0.000000  0.000000
1  0.333333  0.333333
2  0.666667  0.666667
3  1.000000  1.000000

### Standardisation

In [6]:
from sklearn.preprocessing import StandardScaler

Standardisation = StandardScaler()

x_after_Standardisation = Standardisation.fit_transform(x)

x_after_Standardisation

array([[-1.34164079, -1.34164079],
       [-0.4472136 , -0.4472136 ],
       [ 0.4472136 ,  0.4472136 ],
       [ 1.34164079,  1.34164079]])

In [7]:
df1 = pd.DataFrame(data = x_after_Standardisation,columns = ['Age','salary'] )

In [8]:
df1

        Age    salary
0 -1.341641 -1.341641
1 -0.447214 -0.447214
2  0.447214  0.447214
3  1.341641  1.341641